Revit 2027 API
SharedCoordinatesFailures Properties
The BuiltInFailures.SharedCoordinatesFailures type exposes the following members.
Properties
Name | Description
CannotAcquireCoordinatesFromLinkWithScaledLocation |  Can't acquire coordiantes from a link that has a scaled location.
CannotAcquireCoordinatesFromScaledLink |  Can't acquire coordinates from a link that is scaled.
Top
See Also
Reference
BuiltInFailures.SharedCoordinatesFailures Class
Autodesk.Revit.DB Namespace